doc/els.tex
% Created 2023-02-12 Sun 13:35
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Submission topics include, but are not limited to:}
\label{sec:orgd28cc72}

\begin{itemize}
\item Context-, aspect-, domain-oriented and generative programming
\item Macro-, reflective-, meta- and/or rule-based development approaches
\item Language design and implementation
\item Language integration, inter-operation and deployment
\item Development methodologies, support and environments
\item Educational approaches and perspectives
\item Experience reports and case studies
\end{itemize}

\section{We invite submissions in the following forms:}
\label{sec:org74ce674}

\begin{itemize}
\item Papers: Technical papers of up to 8 pages 
that describe original results or explain 
known ideas in new and elegant ways.
\item Tutorials: Abstracts of up to 4 pages
for in-depth presentations about topics
of special interest.
\item Demonstrations: Abstracts of up to 4 pages
for demonstrations of tools, libraries, and applications.
\item Experience reports: papers of up to 6 pages
describing a Lisp success story and/or analyzing
obstacles that have kept it from working in practice.
\end{itemize}


\section{GRASP: An Extensible Tactile Interface for Editing S-expressions}
\label{sec:org28b6af6}

GRASP is a Scheme-based extensible computational environment
designed to work with S-expressions on touch screens. It features
a powerful extension mechanism as well as a subsystem for
handling gesture-based input. It is implemented in Kawa Scheme,
and can be compiled as an Android application as well as run
on a desktop windowing environment and inside of terminal
emulators.

GRASP is still a work-in-progress application, so the purpose
of the demo is:
\begin{enumerate}
\item to show the current state of the application;
\item to convey the ultimate vision behind GRASP;
\item to present the development plan and methodology, and optionally:
\item to describe the hitherto history of the development.
\end{enumerate}

The presentation of GRASP in this paper is written as if
all of its features were already implemented. The omissions
are presented in a seperate section.

\section{The concept of GRASP}
\label{sec:orge818709}

GRASP is a tactile-first structural editor for S-expressions.
Its design is based on representing S-expressions as
nestable boxes. The boxes are rendered so that their left 
and right edge resemble - respectively - opening and closing 
parentheses.

When displayed in a terminal, a Lisp program edited in GRASP
might look like this:

\begin{verbatim}
╭        ╭     ╮                       ╮
│ define │ ! n │                       │
│        ╰     ╯                       │
│ ❝┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈• │
│ ┊ Computes the product 1*...*n.    ┊ │
│ ┊ It represents the number of per- ┊ │
│ ┊ mutations of an n-element set.   ┊ │
│ •┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈❞ │
│   ╭    ╭        ╮                 ╮  │
│   │ if │ <= n 0 │                 │  │
│   │    ╰        ╯                 │  │
│   │                               │  │
│   │       1                       │  │
│   │                               │  │
│   │       ╭     ╭   ╭       ╮ ╮ ╮ │  │
│   │       │ * n │ ! │ - n 1 │ │ │ │  │
╰   ╰       ╰     ╰   ╰       ╯ ╯ ╯ ╯  ╯
╭      ╭             ╮          ╮       
│ e.g. │ factorial 5 │ ===> 120 │       
╰      ╰             ╯          ╯       
\end{verbatim}

which corresponds to the following program text:

\begin{verbatim}
(define (! n)
"Computes the product 1*...*n.
It represents the number of per-
mutations of an n-element set."
  (if (<= n 0)
      1
      (* n (! (- n 1))))) 
(e.g. (factorial 5) ===> 120)
\end{verbatim}

The left and right parentheses play different roles in 
tactile editing: the left parenthesis is used for moving
(if pressed once) or copying (if pressed twice) an expression,
whereas the right parenthesis is used for resizing an expression.

An expression which is currently being moved can be deleted
by throwing it off the surface quickly. Likewise, moving
a finger quickly while the expression is being resized
causes the box to be spliced into its parent (this feature
is sometimes referred to as "pulling-the-rug splicing").

In addition to boxes, GRASP offers four other types
of objects: atoms, texts, extensions and comments.

Atoms are things like symbols, numbers, characters
or boolean values in Lisp. They support touch
gestures in a similar way as the left parenthesis
of a box: single touch causes them to be dragged,
whereas double touch causes their copy to be dragged.

The text type corresponds to strings. They are 
displayed inside boxes with quotation marks
on their corners. The roles of the quotation
marks are analogous to the left and the right
parenthesis: the left one can be used to
move the text within the expression tree,
remove it or copy, while the right one can be used
to change the shape of a text.

Comments in the Scheme programming language come in
three flavours, all of which are supported by GRASP:
\begin{itemize}
\item line comments, which span until the end of a given line;
\item block comments, which are similar to text;
\item expression comments, which comment out a single expression.
\end{itemize}

Comments are invisible to the operations
on the document, such as or . 
Other than that, line and block comments are similar to text.

The last type of objects supported by the editor
are extensions. The list of extensions is open-ended.
Expressions are sometimes refered to as "magic boxes",
because they are boxes which define their own rules
of interaction.

A simple example of an extension is a button.
If it is loaded, the expression

\begin{verbatim}
(Button label: "Press me" 
	action: (lambda () (WARN "button pressed")))
\end{verbatim}

can be rendered as a button, and respond
to touch events with the invocation of its
action callback.

The terminal client of GRASP would display
it in the following manner:

\begin{verbatim}
╭───────────╮
│ Press me! │
╰───────────╯
\end{verbatim}

Extensions are meant to be user-definable, but
the exact API for defining them is subject to
an ongoing research.

Some desired extensions for GRASP include:
\begin{itemize}
\item a drawing editor
\item a graph visualiser/editor
\item a visual evaluator
\item a function plotter
\end{itemize}

and many others.

\subsection{Gesture-based input}
\label{sec:org985195f}

Since devices with touch screens often lack
a proper keyboard, and usually display regrettable
keyboard substitutes on their screens as needed,
GRASP attempts to find a more ergonomic alternative.

One idea is gesture-based input: the user draws
a shape on the screen, and if the shape is recognized,
an appropriate action is performed.

By default, the following shapes are recognized:
\begin{itemize}
\item horizontal line, which splits the pane it's
drawn over vertically into two smaller panes
(similar to C-x 2 in Emacs)

\item vertical line, which splits the pane below
horizontally into two smaller panes
(similar to C-x 3 in Emacs)

\item a box gesture, which creates a new box in the
document it's drawn over

\item an underscore gesture, which creates a new atom
in the document it's drawn over

\item a wedge symbol, which causes the expression
below its blade to be evaluated (similar to
C-x C-e in Emacs' Lisp interaction modes)
\end{itemize}

Since many touchscreen-equipped devices also
feature accelerometers, GRASP also lets define
motion-based edit operations - for example, shaking
a device might result in re-indenting the source
code.
