doc/els.org
*** Keyboard input 

    Even though GRASP focuses on tactile editing
    and on mobile devices, a lot of effort has been
    put into making it a pleasant keyboard editing
    experience.

    GRASP features a flexible key binding mechanism,
    which unites the input systems from its target
    environments (Android, terminal and windowing
    systems).

    By default, it provides the "Common User Access"
    keyboard bindings (ctrl-z fo undo, ctrl-c for copy
    etc.) and it allows to use keyboard arrows to
    navigate cursor over the active document.
    
    Keyboard editing is context-sensitive, so
    for example pressing the src_scheme{#\[} key creates a new box,
    unless the cursor is located on a text element,
    in which case the src_scheme{#\[} character is inserted verbatim
    into text.
    
    Also, extensions are free to interpret
    most of the pressed characters as they please.

* Implementation

   GRASP is still a very immature editor, and many 
   of its implementation details are likely to change. 
   However, there are certain design decisions that
   will probably stay fixed throughout the lifetime
   of GRASP.

** Kawa and JVM interoperation

   GRASP is implemented in - and intimately coupled
   to - Kawa, the implementation of Scheme which runs
   on the Java Virtual Machine and produces JVM byte code.

   The main reason for this decision is that JVM
   byte code can be translated to run on Android,
   which was both the initial developmen platform
   of GRASP, as well as its main target.
   
   Kawa Scheme offers a few interesting extensions
   to facilitate interoperation with JVM: first,
   it exposes Java's object model to Scheme
   (using the src_scheme{define-simple-class} special form);
   second, it extends Scheme with an optional syntax
   for declaring types, and provides a Java-like type
   system.

   GRASP uses Scheme's syntax extension mechanisms
   to provide two alternative ways of defining new
   types.

*** The record system

   The first mechanism for defining new types 
   probably also happens to be the first almost decent
   record system in the history of Lisp.

   It lets programmers define record types in the following
   way:

#+BEGIN_SRC scheme
(define-type (Extent width: real := 0
                     height: real := 0))
#+END_SRC

  A new instance of a record defined this way can be
  created by typing, say

#+BEGIN_SRC scheme
(define carpet ::Extent (Extent width: 5 height: 10))
#+END_SRC

  and the fields can be accessed using Kawa's reader
  extension:

#+BEGIN_SRC scheme
  > carpet:width ; => 5
  > carpet:height ; => 10
#+END_SRC

  GRASP source code also contains a pattern matcher
  which allows to destructure records defined that way:

#+BEGIN_SRC scheme
(define (square-or-rectangle e)
  (match e
    ((Extent width: x height: x)
     `(a square with side length ,x))
    ((Extent width: x height: y)
     `(an ,x by ,y rectangle))
    (_
     'what-are-you-giving-me?)))
#+END_SRC

  Records can also implement interfaces and provide methods
  that can be invoked on them, although the syntax is not 
  entirely satisfactory:

#+BEGIN_SRC scheme
(define-type (Move from: Cursor
		   to: Cursor
		   in: pair := (the-document)
		   with-shift: int := 0)
  implementing Edit
  with
  ((apply!)::Cursor
   (let ((item (extract! at: from from: in)))
     (insert! item into: in at: to)
     (cursor-climb-back to in)))

  ((inverse)::Edit
   (match (this)
     ((Move from: `(,s0 . ,source)
            to: `(,d0 ,d1 . ,destination)
	    in: document
	    with-shift: s)
      (Move from: (recons (+ d1 1) destination)
            to: (recons* s (- s0 1) source)
	    in: document
	    with-shift: d0)))))
#+END_SRC

*** Environment-like class definitions

  The second syntax provided by GRASP for defining
  Java classes is the src_scheme{define-object} form, which allows
  for environment-like class definitions:

#+BEGIN_SRC scheme
(define-object (ClassName constructor-params ...)::Interface
  (define field ::type initial-value)
  ...
  (define (method args ...)::result-type body ...)
  ...
  (SuperClass constructor-args ...)
  initialization-code ...)
#+END_SRC

  This syntax has some quirks, but since the slot and method
  definitions are syntactically identical to top-level procedure
  and variable definitions, the refactoring is facilitated,
  because moving forms between the top level and class definitions
  requires no additional actions.

  It is also noteworthy that both type definition mechanisms
  deliberately limit the expressiveness of the raw Java-style
  class definition (for example, by letting only one constructor
  to be present in the definition).

