doc/els.tex

\subsection{The document representation}
\label{sec:org9f59646}

Documents in GRASP are essentially represented
using cons-cells. There are some caveats to this, though.

First, GRASP does not use the implementation of cons-cells
provided by Kawa: instead, it sub-classes Kawa's gnu.lists.Pair
class, and adds two significant modifications:
\begin{itemize}
\item it overrides the getCar and getCdr methods (which are
internally invoked upon calling car and cdr in Scheme)
so that their behavior depends on value of 
parameter:
\begin{itemize}
\item if the value of is 
(the default), then
instead of returning atomic values such as symbols or numbers, 
the and will return proxy 
values of type
\item otherwise, if the value of 
is , then the actual
Scheme atoms will be returned by the and 
operations
\end{itemize}
\item it overrides the method to use the default Java's
object identity (rather than Scheme's -like
identity provided by Kawa)
\end{itemize}

The reason why the -like identity is unsatifactory
is because GRASP uses Java implementation of weak-key
hash tables in order to represent whitespace and comments
between the elements of a -cell. (This
representation was initially chosen because most implementations
of Scheme do not allow to modify the representation of 
-cells, so hash-tables seemed to be the only
viable choice.)

In the parlance of GRASP, weak-key hash tables are called
"properties", and GRASP provides a fairly elegant way
of expressing them, using the so called "getters with setters".

More specifically, there are five properties to describe
how -cells are formatted: 
\begin{enumerate}
\item , which designates a
following cell's head,
\item , which designates 
a between an opening parenthesis 
and the first element of a list (and as such it doesn't
matter for most cells),
\item , which - in the case of dotted pairs
designates a following the "dot"
\item , which - in the case of dotted pairs
designates a following the pair's tail
\item , which designates a boolean value that
specifies whether a given cell should be considered as dotted.

This stems from the fact that from the perspective
of a Lisp reader, the notation 
is indistinguishable from .

objects designated by the first four properties
are objects that contain a single list. The list needs
to contain at least one integer number, which signifies
the number of spaces that ought to be inserted at a given
place. The presence of two consequent numbers signifies
a line break - so while the list means a single
horizontal space, the list means a line break.

In addition to integers, the list can also contain
three types of compound objects, which represent
three types of comments defined by Scheme - line comments,
block comments and expression comments.
\end{enumerate}

A GRASP document is wrapped in an additional -cell
(whose is meaningless), so that it is possible
to represent comments and whitespace of an empty document,
as well as express editing operations in a uniform way.

\subsection{The cursor representation}
\label{sec:org64733a7}

The representation of a cursor in a text editor is fairly
straightforward: it is sufficient to provide a line number
and a column to characterize the location of a cursor
in a file.

In the case of a tree editor, a cursor needs to be expressed
as a path on a document tree - a list of indices
of expression at the subsequent levels on the tree.

The indices can be used to refer to the elements
from a list, but they can also be used to refer to
whitespace between the elements on the list. If we take,
say, an improper list , then index 0
refers to an empty space () between 
the opening paren and the element , index 1 refers 
to the element , index 2 - to the space 
()
following the element , index 3 - to the element 
,
index 4 to the space following the element ,
index 5 to the element , index 6 to the space following
the element , index 7 - to the head/tail 
separator (dot) pseudo-element, 8 to the space following the dot
(), index 9 - to the element 
and index 10 - to the space following 
().

In the above list, two non-numerical indices are legal:
the index refers to the opening parenthesis,
and the index - to the closing parenthesis. Those
elements cannot be individually picked up, but the keyboard
cursor can be positioned on them.

Of course, in order to be able to refer to an element
in a nested structure, a sequence of indices is needed.

In GRASP, such a sequence needs to be decoded from right
to left - the rightmost index selects the expression
from the top-level. (Actually, since the documents in
GRASP are wrapped in an additional cons cell, the rightmost
index is always 1.)

This strategy allows to maximize structural sharing
between cursors and to prevennt garbage generation
by utilizing hash-consing. (This seems important, because
e.g. the rendering function generates cursors to all
rendered elements of the tree.)
Hash-consing requires that cursors are treated as
immutable.

The function for refering to an element by cursor
could be defined in the following way:

\begin{verbatim}
(define (cursor-ref document cursor)
  (match cursor
    ('()
     document)
    (`(,head . ,tail)
     (let ((parent (cursor-ref document tail)))
       (part-at head parent)))))
\end{verbatim}

where is a polymorphic function that selects
a sub-element from a given element. For lists,
is defined so that it conforms to the indexing
scheme mentioned above, where even indices refer
to spaces, and odd indices refer to actual elements.

For the and indices, the 
function returns the list itself. 
Likewise, for any atom, the function will
always return the atom itself.

A cursor such that 
\begin{verbatim}
(eq? (cursor-ref document cursor)
     (cursor-ref document (cdr cursor)))
\end{verbatim}
is considered to be \textbf{fully expanded}.

In practice, most operations in GRASP require
fully expanded cursors, and keyboard navigation
procedures should only generate fully expanded
cursors.
