doc/els.org
** The "undo" mechanism

   The documents in GRASP are considered mutable,
   and the editing of a document occurs by means
   of mutating the tree structure.

   However, all these mutations are intermediated
   by explicit Edit operations. Each such operation
   has its inverse, which on one hand is used to
   implement the "undo" mechanism, and on 
   the other- can be perceived as an interesting 
   "document editing assembly language".

   At the moment of writing this text, the langauge
   consists of the following operations:

#+BEGIN_SRC scheme

(Move from: Cursor
      to: Cursor
      in: pair := (the-document)
      with-shift: int := 0)
;; the Move operation is its own inverse


(Insert element: (either pair HeadTailSeparator)
        at: Cursor := (the-cursor)
        into: pair := (the-document))

(Remove element: (either pair
                         HeadTailSeparator
                         EmptyListProxy)
        at: Cursor := (the-cursor)
        from: pair := (the-document)
        with-shift: int := 0)
;; the Move and Remove operations are mutually inverse

(ResizeBox at: Cursor := (the-cursor)
           from: Extent
           to: Extent
           in: pair := (the-document)
           with-anchor: real)
;; the ResizeBox operation is its own inverse


(InsertCharacter list: (list-of char)
                 after: Cursor := (the-cursor)
                 into: pair := (the-document))

(RemoveCharacter list: (list-of char)
                 before: Cursor := (the-cursor)
                 from: pair := (the-document))
;; InsertCharacter and RemoveCharacter are mutually inverse


(SplitElement with: Space
              at: Cursor := (the-cursor)
              in: pair := (the-document))

(MergeElements removing: Space
               at: Cursor := (the-cursor)
               in: pair := (the-document))
;; SplitElement and MergeElements are mutually inverse


(NoEdit)
;; the NoEdit operation is its own inverse

#+END_SRC

   More details can be found in the source code
   of GRASP.

   It is imaginable that some future version
   of GRASP could observe the actions performed
   by user and the structure of the document,
   and suggest certain operations based on
   previous actions (resembling Excel's auto-fill
   feature).
   
* Evident programming
  
  One of the deep philosophical underpinnings
  of GRASP is the idea that code is easier to study
  when it's accompanied by concrete, tangible examples.

  For example, consider the famous definition:

#+BEGIN_SRC scheme
(define (f lol)
  (apply map list lol))
+END_SRC
   
  Even though it consists of only three simple terms,
  comprehending the above code can be very puzzling.
  However, if we consider that

#+BEGIN_SRC scheme
(e.g.
  (f '((a b c)
       (d e f))) ===> ((a d)
                       (b e)
                       (c f)))
#+END_SRC

  then its purpose becomes clear immediately, even though
  the name src_scheme{f} isn't particularly well chosen.

  This style of programming - where definitions are
  interleaved with usage examples - can be practiced
  in most implementations of Lisp - but only as long
  as it concerns things that can be expressed
  as textual objects. 

  However, once we enter the realm of things which cannot
  be expressed as textual objects, the examples become
  incomprehensible.

  Consider, for example, the following list of complex numbers:

#+BEGIN_SRC
(0.5403023058681398+0.8414709848078965i 
-0.4161468365471424+0.9092974268256817i
-0.9899924966004454+0.1411200080598672i
-0.6536436208636119-0.7568024953079282i
 0.28366218546322625-0.9589242746631385i 
 0.960170286650366-0.27941549819892586i
 0.7539022543433046+0.6569865987187891i
-0.14550003380861354+0.9893582466233818i)
#+END_SRC
  
  It may not be immediately apparent that all these points
  lie on a unit circle - which would be obvious if only they
  were plotted on the screen.

  And obviously, there exist specialized tools
  which allow for that. But they are rarely integrated
  with code editors in a way that wouldn't harm
  the workflow of people who do not use those code
  editors.

  The author of GRASP calls the example-rich approach
  "evident programming", because it is an attempt
  of making all components of a program as simple
  and tangible as possible.

  As a matter of fact, GRASP itself attempts to exploit
  this approach to the extent that is possible
  in the medium of text. In addition to terminal
  client, desktop client and Android client,
  GRASP provides a backend for rendering documents
  as strings. This allows to write tests in the
  following form:

#+BEGIN_SRC scheme
(insert-character! #\[)

(e.g.
 (snapshot) ===> "
╭  ╮
│  │
╰ |╯
")

(undo!)

(e.g.
 (snapshot) ===> "
")

(redo!)

(e.g.
 (snapshot) ===> "
╭  ╮
│  │
╰ |╯
")

(for-each insert-character! '(#\d #\e #\f #\n #\e))

(e.g.
 (snapshot) ===> "
╭       ╮
│ defne │
╰      ^╯
")

(times 2 move-cursor-left!)

(e.g.
 (snapshot) ===> "
╭       ╮
│ defne │
╰    ^  ╯
")
#+END_SRC

The author believes that such tests should be
approachable not only to people who are new
to the GRASP code base, but also to people
who are new to programming. They are a good
starting point for understanding the roles
of particular operators defined in the GRASP
code base.

