doc/els.org
* Development history

  The development of GRASP begun in the late
  2018 with the announcement of "The Draggable
  Rectangle Challenge". The first prototype
  was created in Racket at the beginning of 2019,
  and was presented during that year's spring edition
  of RacketFest in Berlin, although it wasn't
  an actually usable program.

  In the meantime, the author's computer broke
  down due to some unfortunate accident, and
  the only programmable device that the author
  was left with was his Android phone.

  Since the author managed to figure out how
  to build Android applications on Android
  (using the Termux app), he decided to write
  a prototype of a touchscreen-based editor.
  
  The first iteration was written in the spring
  of the pandemic year 2020, entirely on the phone,
  entirely in the Java programming language (TM).
  It allowed its users to create boxes and textual
  symbols, but it didn't allow them to save or load
  files, scroll documents or evaluate expressions,
  so it was essentially a toy, and its user
  interface was very clumsy. Its architecture
  was also willy-nilly, and it quickly turned out
  that it cannot be further developed.

  So in the beginning of 2021 the author decided
  to start the project over.
  
  By the end of the summer, he managed to build an editor
  which could open and save files, split screen,
  edit multiple files and support a rich set of gestures.
  This version of the editor was presented during the 2021 Scheme
  Workshop/ICFP. After the presentation, the author
  also managed to integrate the editor with Kawa Scheme,
  and presented it at a local Hackerspace event in Poland,
  where it was very well received.

  However, even though the editor is an actually usable
  applications, it also turned out to suffer from a number
  of shortcomings. First, it was only able to represent
  proper lists and atoms, and adding support for improper lists,
  strings and comments seemed difficult. Second, it did not support
  cursor, and supporting it also seemed difficult.
  Third, it was based on direct manipulation of expressions,
  and there was no obvious way of adding the "undo" feature.
  Most importantly, the editor was written in Java,
  which meant that - being an s-expression editor - it could
  not be used to further develop itself (and the inclusion
  of the Kawa compiler significantly increased its build times).
  
  So in the beginning of 2022 the author decided
  to start the project over.
  
  This time it was evisioned as a cross-platform project
  from the beginning. However, the only "common platform"
  between Android and PC known to the author was VT-100
  terminal emulator, which determined that - in addition
  to its rich graphics-based clients, GRASP should also provide
  a terminal client, which - even if not as capable
  as its more advanced siblings - would still be useful.

  Besides, adding it was fairly simple, given that a lot of
  functionality is shared with a string-rendering backend
  which has been used for testing.

  So far, the development of the latest iteration of GRASP
  already took over a year, so in the beginning of 2023,
  the author has decided not to start the project over,
  which he believed was a good sign.

* Current progress

  Although this paper could leave a different impression,
  at the moment of writing (February 2023) GRASP isn't yet 
  a usable application - in some ways it is inferior to the
  Java-based Android client that was demoed in 2021
  in that:
  - it doesn't let open or save files
  - it doesn't let split or scroll the screen
  - it doesn't let evaluate expressions
  - it doesn't support the basic gestures
  - the extension mechanism isn't available

  In certain areas, it also seems to have similar
  shortcomings:
  - it doesn't support displaying nor editing
    comments
  - although it should display improper lists correctly, 
    editing them has not been tested well 

  Fortunately, there's still some time before
  European Lisp Symposium, which takes place late
  in April. Currently, the author envisions two
  milestones for the project:
  1. to reach the point that would let GRASP
     be used for developing itself
  2. to support extension mechanism and focus
     on the development of particular extensions

  The author believes that reaching milestone 1
  before ELS might be possible. A more detailed
  plan is the following:
  - support for keyboard editing (mostly done)
  - support for displaying and editing comments
    (they are already handled by parser)
  - support for vertical keyboard movement
    (currently works somewhat but is a kludge)
  - support for loading and saving files
  - support for screen splitting and scrolling
  - support for syntactic extensions provided
    by Kawa that are used in GRASP
  - tests and bug fixes

* Related work

   The strongest source of inspiration for GRASP
   has been Emacs, and the Scheme interaction
   mode provided by the Geiser package. One
   motivation for the development of GRASP was
   the desire to share experience of Lisp interaction
   mode outside the world of Emacs, with possible
   improvements. (Some fundamental shortcomings
   of Emacs were pointed out with the announcement
   of Project Mage in the January of 2023.)

   The desire to add interactive visual extensions
   was born when the author attempted to extend
   the idea of "evident programming" to the domain
   of computational geometry and graph algorithms.
   
   However, the same idea was independently
   conceived by Leif Andersen, who implemented
   it in dr Racket, and then created a browser-based
   IDE called visr.pl (for Clojure). Leif also provided
   a very good explanation of the idea in a youtube video.
   
   Interactive visual syntax is also a key feature
   of the Polytope editor developed by Elliot Evans.
   Polytope is a dedicated editor for JavaScript.
   
   There are many similatiries between GRASP and
   the Boxer environment developed at MIT in the 1980s
   by Andrea DiSessa and Harold Abelson. Recently
   there have been efforts to resurrect Boxer
   within the Boxer Sunrise project run by Antranig
   Basman and Steven Ghitens. However, building
   the project requires LispWorks, and pre-build
   snapshots are only released for MacOS X. Also,
   despite being written in Lisp, Boxer itself
   is not a Lisp interpreter.
   
   There are other interesting experiments
   in the area of representing programs.
   One example is the Fructure editor developed
   by Andrew Blinn for the Racket programming
   language (the editor itself is implemented
   in a purely functional way, using Racket's
   "big-bang" library).

   Another is OrenoLisp designed by Yasuyuki
   Maeda with the purpose of artistic live
   music coding.

   There's a fun representation of ClojureScript
   programs as nested circles invented by Ella
   Hoeppner for her Vlojure editor.
   
   Katie Bell created a browser-based structural
   editor for Python called SplootCode.
   
   A lot of work concerning data visualisation
   has been happening around the Smalltalk
   distribution called Pharo, and in particular
   its spinoff called Glamorous Toolkit, developed
   by Tudor Girba and his associates.

   There's also a Visual Studio Code plug-in
   called "Debug Visualizer" developed by Henning
   Dieterichs. It lets visualize various data structures
   during the execution of programs, and is available
   for the majority of mainstream programming languages.

   https://marketplace.visualstudio.com/items?itemName=hediet.debug-visualizer
